package com.example.number_calculator;

/**
 * Данный класс содержит несколько строковых констант, которые содержат
 * описания различных калькуляторов и функциональности истории калькулятора.
 */
public class Reference {
    public static final String infoConverter = "Данная программа предназначена" +
            "для вычисления вещественных чисел из" +
            "одной системы счисления в другую." +
            "Программа поддерживает все системы" +
            "счисления от 2 до 16. Также программа" +
            "сохраняет историю всех преобразований.";
    public static final String infoComplex = "Комплексный калькулятор - это калькулятор," +
            " который может выполнять арифметические операции с комплексными числами." +
            " Реализация такого калькулятора может включать в себя интерфейс пользователя (GUI)," +
            " который позволяет вводить комплексные числа и выбирать операции, такие как сложение," +
            " вычитание, умножение и деление. Внутри калькулятора должна быть реализована логика, " +
            "которая обрабатывает вводимые значения и выполняет выбранную операцию, результат которой " +
            "также может быть комплексным числом. Возможно, также потребуется реализовать" +
            " дополнительные функции, такие как вычисление модуля и аргумента комплексного" +
            " числа, перевод из алгебраической формы в показательную и обратно.";
    public static final String infoFraction = "Дробный калькулятор - это приложение," +
            " которое позволяет выполнять арифметические операции с дробными числами." +
            " Пользователь вводит числа и операции через графический интерфейс, после" +
            " чего приложение выполняет расчеты и выводит результат на экран." +
            " Реализация может включать в себя классы для представления чисел," +
            " классы для выполнения операций, а также графический" +
            " интерфейс с элементами для ввода и вывода информации.";

    public static final String infoHistory="Функциональность истории калькулятора" +
            " может быть реализована путем сохранения истории всех вычислений," +
            " которые были выполнены пользователем во время работы приложения." +
            " Каждое вычисление сохраняется в специальный список, " +
            "который может быть просмотрен пользователем в любой момент времени.";
}
